AUTO_config_TK_pesok/src/InformationRegisters/РезультатыВыполненияОбработок/РезультатыВыполненияОбработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыВыполненияОбработок</name>
  <resources>
    <name>Успешный</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СообщенияОбОшибках</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_ДатыОстатковOS/ТК_ДатыОстатковOS.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_ДатыОстатковOS</name>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаПолнойВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>СкладКомпании</name>
    <type>
      <types>CatalogRef.СкладыКомпании</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/InformationRegisters/ТК_СправочникиСкубис/ТК_СправочникиСкубис.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТК_СправочникиСкубис</name>
  <resources>
    <name>Статус</name>
    <comment>0 - новый, 1 - модифицирован,  2 - удален, 3 - Выгружен</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DefinedType.ТК_СправочникиСкубис</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

AUTO_config_TK_pesok/src/CommonModules/ОбменФронтСобытия/Module.bsl
Процедура ПроверитьПодключениеКСерверу(Результат, УзелОбмена, ТекстСообщения) Экспорт
	
	НастройкиПодключения = ПланыОбмена.ОбменФронт.СтруктураНастрокиПодключения();

	ПланыОбмена.ОбменФронт.ЗаполнитьНастройкиПодключения(НастройкиПодключения,УзелОбмена);
	
	ТекстСообщения = "";
	Если ОбменФронт.ВыполнитьТестовоеПодключение(НастройкиПодключения,ТекстСообщения) Тогда
		Результат = Истина;
	Иначе
		ЗаписьЖурналаРегистрации(НСтр("ru='Обмен форонт';uk='Обмін фронт'"),
			УровеньЖурналаРегистрации.Предупреждение,
			УзелОбмена.Метаданные(),
			УзелОбмена,
			ТекстСообщения + НСтр("ru=' Обмен отменен.';uk=' Обмін скасований.'"));

		Результат = Ложь;
	КонецЕсли;
	
КонецПроцедуры




//Выполняет запуск обмена  из регламентного задания.
//
//Параметры:
//   КодУзлаОбмена		- строка с кодом узла плана обмена.
Процедура ЗаданиеВыполнитьОбмен(КодУзлаОбмена) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	УзелОбмена = ПланыОбмена.ОбменФронт.НайтиПоКоду(КодУзлаОбмена);
	
	Если НЕ ЗначениеЗаполнено(УзелОбмена) Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Обмен с фронтом';uk='Обмін з фронтом'"),
			УровеньЖурналаРегистрации.Ошибка,
			УзелОбмена.Метаданные(),
			УзелОбмена,
			НСтр("ru='Не найден узел обмена с кодом';uk='Не знайдений вузол обміну з кодом'") + " " + КодУзлаОбмена);
		
		Возврат;
		
	КонецЕсли;
	
	Если УзелОбмена.ПометкаУдаления Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Обмен с фронтом';uk='Обмін з фронтом'"),
			УровеньЖурналаРегистрации.Информация,
			УзелОбмена.Метаданные(),
			УзелОбмена,
			НСтр("ru='Настройка обмена помечена на удаление. Обмен отменен.';uk='Настройка обміну відмічена для вилучення. Обмін скасовано.'"));
		
		Возврат;
		
	КонецЕсли;
	
	ВыполнитьОбмен(УзелОбмена, НСтр("ru='Фоновый обмен';uk='Фоновий обмін'"));
	
КонецПроцедуры

Процедура ЗаданиеВыполнитьОбменОстатки() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания();
	
	МассивУзелОбмена = ПланыОбмена.ОбменФронт.ПолучитьМассивУзловВыгрузкиОстатковТовара();
	Если МассивУзелОбмена.Количество() = 0 Тогда
		
		ЗаписьЖурналаРегистрации(НСтр("ru='Обмен с фронтом';uk='Обмін з фронтом'"),
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			НСтр("ru='Не найден узел обмена с кодом';uk='Не знайдений вузол обміну з кодом'") + " OS");
		
		Возврат;
		
	КонецЕсли;
	
	
	//Если УзелОбмена.ПометкаУдаления Тогда
	//	
	//	ЗаписьЖурналаРегистрации(НСтр("ru='Обмен с фронтом';uk='Обмін з фронтом'"),
	//		УровеньЖурналаРегистрации.Информация,
	//		УзелОбмена.Метаданные(),
	//		УзелОбмена,
	//		НСтр("ru='Настройка обмена помечена на удаление. Обмен отменен.';uk='Настройка обміну відмічена для вилучення. Обмін скасовано.'"));
	//	
	//	Возврат;
	//	
	//КонецЕсли;
	
	Для Каждого УзелОбмена Из МассивУзелОбмена Цикл 
		ВыполнитьОбменОстатки(УзелОбмена, НСтр("ru='Фоновый обмен остатки по складам';uk='Фоновий обмін залишки по складах'"));
	КонецЦикла;
	
КонецПроцедуры


// Запускает процедуру обмена
//
//Параметры
//	УзелОбмена - Ссылка на план обмена 
//	РежимЗапускаОбмена - строка, поясняющая был ли обмен запущен интерактивно
//						или через регл. задание
//	ВыгружатьТолькоИзменения - Булево, определяет будут выгружаться все данные
// 						или только зарегистрированные. 
//
Процедура ВыполнитьОбмен(УзелОбмена, РежимЗапускаОбмена, ВыгружатьТолькоИзменения = Истина) Экспорт
	Отказ = Ложь;
	ОписаниеОшибки = "";
	ТекстСообщения = "";
	
	ДоступноПодключениеКСерверу = Ложь;
	ПроверитьПодключениеКСерверу(ДоступноПодключениеКСерверу,УзелОбмена,ТекстСообщения);
	
	Если Не ДоступноПодключениеКСерверу Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	
	 	
	ТаблицаИнформации = РегистрыСведений.СостоянияОбменовДанными.СоздатьНаборЗаписей().Выгрузить();
	ТаблицаИнформации.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));

	ПараметрыОбмена = ПланыОбмена.ОбменФронт.ЗаполнитьПараметрыОбмена(УзелОбмена); 	
	ПараметрыОбмена.Вставить("РежимЗапускаОбмена", РежимЗапускаОбмена);
	ПараметрыОбмена.Вставить("ДатаФормирования",ТекущаяДата());
	РезультатОбмена = Новый  Структура;
	
	
	ОбменФронт.ВыполнитьОбменСфронтом(ПараметрыОбмена,РезультатОбмена,ТаблицаИнформации);
	
	
	Ошибка = НЕ РезультатОбмена.Успешно;
	
	ВыполнитьДействияПриЗавершенииОбмена(ПараметрыОбмена, ТаблицаИнформации,РезультатОбмена,Ошибка);

	
	
КонецПроцедуры

// Запускает процедуру обмена остатки
//
//Параметры
//	УзелОбмена - Ссылка на план обмена 
//	РежимЗапускаОбмена - строка, поясняющая был ли обмен запущен интерактивно
//						или через регл. задание
//	ВыгружатьТолькоИзменения - Булево, определяет будут выгружаться все данные
// 						или только зарегистрированные. 
//
Процедура ВыполнитьОбменОстатки(УзелОбмена, РежимЗапускаОбмена) Экспорт
	Отказ = Ложь;
	ОписаниеОшибки = "";
	ТекстСообщения = "";
	
	ДоступноПодключениеКСерверу = Ложь;
	ПроверитьПодключениеКСерверу(ДоступноПодключениеКСерверу,УзелОбмена,ТекстСообщения);
	
	Если Не ДоступноПодключениеКСерверу Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	
	 	
	ТаблицаИнформации = РегистрыСведений.СостоянияОбменовДанными.СоздатьНаборЗаписей().Выгрузить();
	ТаблицаИнформации.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));

	ПараметрыОбмена = ПланыОбмена.ОбменФронт.ЗаполнитьПараметрыОбмена(УзелОбмена); 	
	ПараметрыОбмена.Вставить("РежимЗапускаОбмена", РежимЗапускаОбмена);
	ПараметрыОбмена.Вставить("ДатаФормирования",ТекущаяДата());
	РезультатОбмена = Новый  Структура;
	
	
	ОбменФронт.ВыполнитьОбменСфронтомОстатки(ПараметрыОбмена,РезультатОбмена,ТаблицаИнформации);
	
	
	Ошибка = НЕ РезультатОбмена.Успешно;
	
	ВыполнитьДействияПриЗавершенииОбмена(ПараметрыОбмена, ТаблицаИнформации,РезультатОбмена, Ошибка, Истина);

	
	
КонецПроцедуры

Процедура ВыполнитьВыгрузкуОстатков(УзелОбмена,МассивСкладов, РежимЗапускаОбмена)Экспорт
	Отказ = Ложь;
	ОписаниеОшибки = "";
	ТекстСообщения = "";
	
	ДоступноПодключениеКСерверу = Ложь;
	ПроверитьПодключениеКСерверу(ДоступноПодключениеКСерверу,УзелОбмена,ТекстСообщения);
	
	Если Не ДоступноПодключениеКСерверу Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	
	
	ТаблицаИнформации = РегистрыСведений.СостоянияОбменовДанными.СоздатьНаборЗаписей().Выгрузить();
	ТаблицаИнформации.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));
	
	ПараметрыОбмена = ПланыОбмена.ОбменФронт.ЗаполнитьПараметрыОбмена(УзелОбмена); 	
	ПараметрыОбмена.Вставить("РежимЗапускаОбмена", РежимЗапускаОбмена);
	ПараметрыОбмена.Вставить("ДатаФормирования",ТекущаяДата());
	РезультатОбмена = Новый  Структура;
	
	
	ОбменФронт.ВыполнитьОбменСфронтомОстаткиПоСкладам(ПараметрыОбмена,РезультатОбмена,ТаблицаИнформации,МассивСкладов);
	
	
	Ошибка = НЕ РезультатОбмена.Успешно;
	
	ВыполнитьДействияПриЗавершенииОбмена(ПараметрыОбмена, ТаблицаИнформации,РезультатОбмена, Ошибка);
	
КонецПроцедуры

Процедура ВыполнитьВыгрузкуКонтрагентов(УзелОбмена,РежимЗапускаОбмена)Экспорт
	Отказ = Ложь;
	ОписаниеОшибки = "";
	ТекстСообщения = "";
	
	ДоступноПодключениеКСерверу = Ложь;
	ПроверитьПодключениеКСерверу(ДоступноПодключениеКСерверу,УзелОбмена,ТекстСообщения);
	
	Если Не ДоступноПодключениеКСерверу Тогда
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ТаблицаИнформации = РегистрыСведений.СостоянияОбменовДанными.СоздатьНаборЗаписей().Выгрузить();
	ТаблицаИнформации.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка"));

	
	ПараметрыОбмена = ПланыОбмена.ОбменФронт.ЗаполнитьПараметрыОбмена(УзелОбмена); 	
	ПараметрыОбмена.Вставить("РежимЗапускаОбмена", РежимЗапускаОбмена);
	ПараметрыОбмена.Вставить("ДатаФормирования",ТекущаяДата());
	РезультатОбмена = Новый  Структура;

		
	ОбменФронт.ВыполнитьОбменСфронтомКонтрагенты(ПараметрыОбмена,РезультатОбмена,ТаблицаИнформации);
	
	
	Ошибка = НЕ РезультатОбмена.Успешно;
	
	ВыполнитьДействияПриЗавершенииОбмена(ПараметрыОбмена, ТаблицаИнформации,РезультатОбмена, Ошибка);
	

	
КонецПроцедуры





// Выполняет необходимые действия при завершении обмена.
//
// Параметры:
//	Параметры - Структура основных параметров
//	ТаблицаИнформации - Таблица значений, состояние текущего сеанса обмена
//	Ошибка - Булево, Истина, если необходимо зафиксировать завершение обмена с ошибками.
//
Процедура ВыполнитьДействияПриЗавершенииОбмена(Параметры, ТаблицаИнформации,РезультатОбмена, Ошибка = Ложь, Остатки = Ложь)
	
	ТаблицаИнформации.ЗаполнитьЗначения(Параметры.УзелОбмена, "УзелИнформационнойБазы");
	
	// Записываем информацию по каждому действию в журнал регистрации.
	
	
	СтруктруаЗаписиРезультатаВыполнения = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктруаЗаписиРезультатаВыполнения.ИдентификаторОбработки = "Обмен OS";
	СтруктруаЗаписиРезультатаВыполнения.КлючОбработки = Строка(Параметры.УзелОбмена)+?(Остатки," Остатки","");
	
	
	Для Каждого СтрокаТаблицыИнформации Из ТаблицаИнформации Цикл
		
		
		Если СтрокаТаблицыИнформации.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Выполнено Тогда
			УровеньСообщения = СтатусСообщения.Информация;
		Иначе
			УровеньСообщения =  СтатусСообщения.ОченьВажное;
		КонецЕсли;
		
		
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий(СтрокаТаблицыИнформации.Описание, СтруктруаЗаписиРезультатаВыполнения, УровеньСообщения);
		
		
		//СобытиеЖурнала = ОбменДаннымиСервер.КлючСообщенияЖурналаРегистрации(Параметры.УзелОбмена,
		//	СтрокаТаблицыИнформации.ДействиеПриОбмене);
		//
		//Если Ошибка Тогда
		//	УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка;
		//КонецЕсли;
		//
		//ЗаписьЖурналаРегистрации(СобытиеЖурнала,
		//	УровеньЖурнала,
		//	Параметры.УзелОбмена.Метаданные(),
		//	Параметры.УзелОбмена,
		//	Параметры.РежимЗапускаОбмена + Символы.ПС+СтрокаТаблицыИнформации.Описание);
		
	КонецЦикла;
	
	
	
	РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктруаЗаписиРезультатаВыполнения, НЕ Ошибка);


	СтрокиВыгрузки = ТаблицаИнформации.НайтиСтроки(Новый Структура("ДействиеПриОбмене",
		Перечисления.ДействияПриОбмене.ВыгрузкаДанных));
	
	Если СтрокиВыгрузки.Количество() = 2 Тогда
		
		Если СтрокиВыгрузки[1].РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Ошибка Тогда
			СтрокиВыгрузки[0].РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Ошибка;
		КонецЕсли;
		
		ТаблицаИнформации.Удалить(СтрокиВыгрузки[1]);
		
	КонецЕсли;
	
	Если НЕ Ошибка И  РезультатОбмена.Свойство("РезультатВыгрузкиОстатков") Тогда
		
		Для Каждого СтрокаЗаписи Из РезультатОбмена.РезультатВыгрузкиОстатков Цикл 
			МенеджерЗаписьСостояния = РегистрыСведений.ТК_ДатыОстатковOS.СоздатьМенеджерЗаписи();
			МенеджерЗаписьСостояния.СкладКомпании = СтрокаЗаписи.СкладКомпании;
			МенеджерЗаписьСостояния.Прочитать();
			
			Если МенеджерЗаписьСостояния.Выбран() Тогда
				МенеджерЗаписьСостояния.ДатаПолнойВыгрузки = СтрокаЗаписи.ДатаПолнойВыгрузки;
				МенеджерЗаписьСостояния.Записать();
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	

	
	//// Записываем состояния обмена.
	//
	//УстановитьПривилегированныйРежим(Истина);
	//
	//Для Каждого СтрокаТаблицыИнформации Из ТаблицаИнформации Цикл
	//	
	//	ЗаписьСостояния = РегистрыСведений.СостоянияОбменовДанными.СоздатьМенеджерЗаписи();
	//	
	//	ЗаполнитьЗначенияСвойств(ЗаписьСостояния, СтрокаТаблицыИнформации);
	//	
	//	// Даты записываем по границам сеанса, чтобы работал отбор журнала.
	//	
	//	ЗаписьСостояния.ДатаНачала = Параметры.ДатаФормирования;
	//	ЗаписьСостояния.ДатаОкончания = ТекущаяДатаСеанса();
	//	
	//	ЗаписьСостояния.Записать();
	//	
	//	Если ЗначениеЗаполнено(ЗаписьСостояния.ДействиеПриОбмене)
	//		И (ЗаписьСостояния.РезультатВыполненияОбмена = Перечисления.РезультатыВыполненияОбмена.Выполнено
	//		ИЛИ ЗаписьСостояния.РезультатВыполненияОбмена
	//			= Перечисления.РезультатыВыполненияОбмена.ВыполненоСПредупреждениями) Тогда
	//		
	//		ЗаписьУспешногоСостояния = РегистрыСведений.СостоянияУспешныхОбменовДанными.СоздатьМенеджерЗаписи();
	//		
	//		ЗаполнитьЗначенияСвойств(ЗаписьУспешногоСостояния, ЗаписьСостояния);
	//		
	//		ЗаписьУспешногоСостояния.Записать();
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ РЕГИСТРАЦИИ ИЗМЕНЕНИЙ

Процедура ЗарегистрироватьИзменения(Объект,Отказ,Замещение = Ложь) Экспорт
	
	Перем  ПодразделениеКомпании;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ОбщегоНазначения.ЭтоДокумент(Объект.Метаданные())  Тогда
		 ПодразделениеКомпании = Объект.ПодразделениеКомпании;
	ИначеЕсли Объект.ДополнительныеСвойства.Свойство("ДляПроведения") Тогда
		Объект.ДополнительныеСвойства.ДляПроведения.Свойство("ПодразделениеКомпании",ПодразделениеКомпании);
	КонецЕсли;
	
	Если  ТипЗнч(Объект) = Тип("ДокументОбъект.ПеремещениеТоваров") Тогда
		
		Если Объект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиала Тогда
			МассивУзлов = ОбменФронтПовтИсп.МассивУзловДляРегистрацииПеремещений(ПодразделениеКомпании);
		Иначе
			Возврат;
		КонецЕсли;	
		
	Иначе
		МассивУзлов = ОбменФронтПовтИсп.МассивУзловДляРегистрации(ПодразделениеКомпании);
	Конецесли;
	
	ОбменФронтПереопределяемый.ЗарегистрироватьИзмененияВУзлах(Объект, МассивУзлов,Замещение);
	
КонецПроцедуры

Процедура ЗарегистрироватьЦеныТовара(Источник,Отказ)Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	МассивУзлов = ОбменФронтПовтИсп.МассивУзловДляРегистрации();
	
	ОбменФронтПереопределяемый.ЗарегистрироватьИзмененияВУзлахЦеныТовара(Источник, МассивУзлов);

	
КонецПроцедуры




Процедура Обмен_OS_ПриЗаписиОбъектаСправочникаПриЗаписи(Источник, Отказ) Экспорт
	 ЗарегистрироватьИзменения(Источник, Отказ)
КонецПроцедуры

Процедура Обмен_OS_ПриЗаписиРегистрСведенийПриЗаписи(Источник, Отказ, Замещение) Экспорт
	ЗарегистрироватьИзменения(Источник, Отказ, Замещение);
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.ШтрихкодыНоменклатуры") И Источник.Количество() > 0 Тогда
		УстановитьПривилегированныйРежим(Истина);
		РегистрыСведений.ТК_СправочникиСкубис.ЗаписатьОбъектСкубис(Источник[0].Номенклатура);
	КонецЕсли;
КонецПроцедуры

///Регистрация узлов OS работающих с остатками 
Процедура Обмен_OS_ПередЗаписьюДокумента(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.ЭтоНовый() ИЛИ РежимЗаписи = РежимЗаписиДокумента.Запись ИЛИ Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбменФронтПереопределяемый.РегистрацияТоваров(Источник,РежимЗаписи,РежимПроведения);
	
	//Если ТипЗнч(Источник) = Тип("ДокументОбъект.Инвентаризация") Тогда
	//	
	//	МассивУзлов = ОбменФронтПовтИсп.МассивУзловДляРегистрацииВыгрузикиИтоговИнвентаризации(Источник.ПодразделениеКомпании);
	//	Если МассивУзлов.Количество() = 0 Тогда
	//		Возврат;
	//	КонецЕсли;
	//	
	//	ОбменФронтПереопределяемый.ЗарегистрироватьИзмененияВУзлах(Источник,МассивУзлов,Ложь);
	//КонецЕсли;
	//
	
КонецПроцедуры

Процедура Обмен_OS_ПриЗаписиДокумента(Источник, Отказ) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	Если НЕ Источник.ДополнительныеСвойства.ЭтоНовый Тогда
		Возврат;
	КонецЕсли;

	ОбменФронтПереопределяемый.РегистрацияТоваров(Источник,Неопределено,Неопределено);
	
	//МассивУзлов = ОбменФронтПовтИсп.МассивУзловДляРегистрацииОстатки();
	//Если МассивУзлов.Количество() = 0 Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ОбменФронтПереопределяемый.ЗарегистрироватьИзмененияТоваровДокумента(Источник, МассивУзлов);

	
КонецПроцедуры


//
Процедура Обмен_OS_ПередЗаписьюДокИзменениеЦен(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат;
	КонецЕсли;
	
	ЗарегистрироватьИзменения(Источник, Отказ)

КонецПроцедуры
